In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

In [9]:
df=pd.read_csv("Patient_Data.csv")

In [11]:
df1=pd.read_csv("Billing_Data.csv")

In [13]:
df.head()

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45

In [15]:
df1.head()

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [17]:
df.shape

(6, 7)

In [19]:
df1.shape

(5, 3)

In [21]:
df.isnull().sum()

PatientID         0
Name              0
Department        0
Doctor            0
BillAmount        2
ReceptionistID    0
CheckInTime       0
dtype: int64

In [23]:
df.duplicated().sum()

1

In [25]:
df1.isnull().sum()

PatientID           0
InsuranceCovered    0
FinalAmount         0
dtype: int64

In [27]:
df1.duplicated().sum()

0

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [37]:
a=df[["PatientID","Department","Doctor","BillAmount"]]

In [39]:
a

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [51]:
a.groupby("Department")["BillAmount"].sum()

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [53]:
a

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [69]:
a.drop_duplicates(inplace=True)

In [71]:
a.groupby("Department")["BillAmount"].sum()

Department
Cardiology     11200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [73]:
a

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN

In [81]:
m=a.BillAmount.mean()

In [83]:
m

6233.333333333333

In [91]:
s=a.fillna({"BillAmount":m})

In [93]:
s

   PatientID   Department     Doctor   BillAmount
0        101   Cardiology  Dr. Smith  5000.000000
1        102    Neurology   Dr. John  6233.333333
2        103  Orthopedics    Dr. Lee  7500.000000
3        104   Cardiology  Dr. Smith  6200.000000
4        105  Dermatology   Dr. Rose  6233.333333

In [99]:
k=pd.merge(df1,s,on="PatientID",how="inner")

In [101]:
k

,PatientID,InsuranceCovered,FinalAmount,Department,Doctor,BillAmount
0,101,2000,3000,Cardiology,Dr. Smith,5000.000000
1,102,1500,3500,Neurology,Dr. John,6233.333333
2,103,2500,5000,Orthopedics,Dr. Lee,7500.000000
3,104,3000,3200,Cardiology,Dr. Smith,6200.000000
4,105,1000,4000,Dermatology,Dr. Rose,6233.333333

In [105]:
dict={"PatientID":[106,107,108,],"InsuranceCovered":[1500,2000,2500],"FinalAmount":[5000,3000,3500],"Department":["Orthopedics","Cardiology","Neurology"],"Doctor":["Dr.Lee","Dr.Smith","Dr.John"],"BillAmount":[7500,5000,6234]}

In [109]:
dict

{'PatientID': [106, 107, 108],
 'InsuranceCovered': [1500, 2000, 2500],
 'FinalAmount': [5000, 3000, 3500],
 'Department': ['Orthopedics', 'Cardiology', 'Neurology'],
 'Doctor': ['Dr.Lee', 'Dr.Smith', 'Dr.John'],
 'BillAmount': [7500, 5000, 6234]}

In [115]:
q=pd.DataFrame(dict)
q

   PatientID  InsuranceCovered  FinalAmount   Department    Doctor  BillAmount
0        106              1500         5000  Orthopedics    Dr.Lee        7500
1        107              2000         3000   Cardiology  Dr.Smith        5000
2        108              2500         3500    Neurology   Dr.John        6234

In [139]:
o=pd.concat([k,q],ignore_index=True,axis=0)
o

,PatientID,InsuranceCovered,FinalAmount,Department,Doctor,BillAmount
0,101,2000,3000,Cardiology,Dr. Smith,5000.000000
1,102,1500,3500,Neurology,Dr. John,6233.333333
2,103,2500,5000,Orthopedics,Dr. Lee,7500.000000
3,104,3000,3200,Cardiology,Dr. Smith,6200.000000
4,105,1000,4000,Dermatology,Dr. Rose,6233.333333
5,106,1500,5000,Orthopedics,Dr.Lee,7500.000000
6,107,2000,3000,Cardiology,Dr.Smith,5000.000000
7,108,2500,3500,Neurology,Dr.John,6234.000000

In [165]:
dict1={"Advance" :[1000,2000,500,1000,500,1000,1500,500],"Balance":[2000,1500,4500,2200,3000,4500,1500,3000]}

In [167]:
dict1

{'Advance': [1000, 2000, 500, 1000, 500, 1000, 1500, 500],
 'Balance': [2000, 1500, 4500, 2200, 3000, 4500, 1500, 3000]}

In [169]:
e=pd.DataFrame(dict1)
e

   Advance  Balance
0     1000     2000
1     2000     1500
2      500     4500
3     1000     2200
4      500     3000
5     1000     4500
6     1500     1500
7      500     3000

In [171]:
pd.concat([o,e],ignore_index=False,axis=1)

,PatientID,InsuranceCovered,FinalAmount,Department,Doctor,BillAmount,Advance,Balance
0,101,2000,3000,Cardiology,Dr. Smith,5000.000000,1000,2000
1,102,1500,3500,Neurology,Dr. John,6233.333333,2000,1500
2,103,2500,5000,Orthopedics,Dr. Lee,7500.000000,500,4500
3,104,3000,3200,Cardiology,Dr. Smith,6200.000000,1000,2200
4,105,1000,4000,Dermatology,Dr. Rose,6233.333333,500,3000
5,106,1500,5000,Orthopedics,Dr.Lee,7500.000000,1000,4500
6,107,2000,3000,Cardiology,Dr.Smith,5000.000000,1500,1500
7,108,2500,3500,Neurology,Dr.John,6234.000000,500,3000